N = 1000  # Загальна кількість спостережень
D1 = 900  # Кількість спостережень для ісправного подшипника
D2 = 100  # Кількість спостережень для неісправного подшипника

# Змінні визначають імовірності вибрації (K1), температури (K2) та загрязнення смазки (K3)
# Поділені на підкатегорії (K11, K12, K13, K21, K22, K23, K31, K32)

PrK11_D1 = 0.7   # Імовірність вибрації в діапазоні 0.25-0.5 для ісправного подшипника
PrK12_D1 = 0.2   # Імовірність вибрації в діапазоні 0.5-0.75 для ісправного подшипника
PrK13_D1 = 0.1   # Імовірність вибрації в діапазоні >0.75 для ісправного подшипника
PrK11_D2 = 0.05  # Імовірність вибрації в діапазоні 0.25-0.5 для неісправного подшипника
PrK12_D2 = 0.15  # Імовірність вибрації в діапазоні 0.5-0.75 для неісправного подшипника
PrK13_D2 = 0.8   # Імовірність вибрації в діапазоні >0.75 для неісправного подшипника

PrK21_D1 = 0.8   # Імовірність температури в діапазоні 50-70°C для ісправного подшипника
PrK22_D1 = 0.1   # Імовірність температури в діапазоні 70-90°C для ісправного подшипника
PrK23_D1 = 0.1   # Імовірність температури в діапазоні >90°C для ісправного подшипника
PrK21_D2 = 0.07  # Імовірність температури в діапазоні 50-70°C для неісправного подшипника
PrK22_D2 = 0.08  # Імовірність температури в діапазоні 70-90°C для неісправного подшипника
PrK23_D2 = 0.85  # Імовірність температури в діапазоні >90°C для неісправного подшипника

PrK31_D1 = 0.9   # Імовірність загрязнення смазки в межах норми для ісправного подшипника
PrK32_D1 = 0.1   # Імовірність повишеного загрязнення смазки для ісправного подшипника
PrK31_D2 = 0.3   # Імовірність загрязнення смазки в межах норми для неісправного подшипника
PrK32_D2 = 0.7   # Імовірність повишеного загрязнення смазки для неісправного подшипника

# Виводимо інформацію про признаки, за якими проводиться спостереження
print('Під час спостереження:')
print(' вібрації у діапазоні 0,25-0,5g (ознака k11);')
print(' температура у діапазоні 70-90°C (ознака k22);')
print(' забруднення змащення вище норми (ознака k32).')

# Обчислюємо загальну ймовірність (PrK_D1) для ісправного подшипника
PrK_D1=PrK11_D1*PrK22_D1*PrK32_D1
# Рахуємо загальну ймовірність (PrK_D2) для неісправного подшипника
PrK_D2=PrK11_D2*PrK22_D2*PrK32_D2
# Загальна імовірність подшипника бути в ісправному(неісправному) стані
PrD1=D1/N
PrD2=D2/N
# Обчислюємо умовну ймовірність PrD1_K для ісправного подшипника та PrD2_K для неісправного подшипника при заданих признаках (формула Байеса)
PrD1_K=PrD1*PrK_D1/(PrD1*PrK_D1+PrD2*PrK_D2)
PrD2_K=PrD2*PrK_D2/(PrD1*PrK_D1+PrD2*PrK_D2)

print('Ймовірність належного стану (діагноз D1) становить:')
print(f"{PrD1_K*100:.4f}%")
print('Ймовірність неналежного стану (діагноз D2) становить:')
print(f"{PrD2_K*100:.4f}%")